In [1]:
import pandas as pd

In [2]:
import numpy as np

In [11]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                'key2':['one','two','one','two','one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)})

In [4]:
df

  key1 keys     data1     data2
0    a  one  0.694209  0.224445
1    a  two  0.179757  0.638223
2    b  one -0.800879  1.246988
3    b  two  0.609712 -0.695102
4    a  one -0.836681  1.186084

In [6]:
grouped=df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a    0.012428
b   -0.095584
Name: data1, dtype: float64

In [12]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [13]:
means

key1  key2
a     one    -1.073834
      two     0.470663
b     one    -0.012053
      two    -0.158350
Name: data1, dtype: float64

In [14]:
means.unstack()

key2       one       two
key1
a    -1.073834  0.470663
b    -0.012053 -0.158350

In [21]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [22]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [23]:
years=np.array([2005,2005,2006,2005,2006])

In [24]:
years

array([2005, 2005, 2006, 2005, 2006])

In [26]:
df['data1'].groupby([states,years]).mean()

California  2005    0.470663
            2006   -0.012053
Ohio        2005   -0.944925
            2006   -0.416168
Name: data1, dtype: float64

In [27]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.559001 -0.449629
b    -0.085202 -0.766561

In [28]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.073834 -0.970305
     two   0.470663  0.591722
b    one  -0.012053 -0.273218
     two  -0.158350 -1.259905

In [29]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [30]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.731499 -1.261049
1    a  two  0.470663  0.591722
4    a  one -0.416168 -0.679561
b
  key1 key2     data1     data2
2    b  one -0.012053 -0.273218
3    b  two -0.158350 -1.259905

In [31]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.731499 -1.261049
4    a  one -0.416168 -0.679561
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.470663  0.591722
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.012053 -0.273218
('b', 'two')
  key1 key2    data1     data2
3    b  two -0.15835 -1.259905

In [32]:
pieces=dict(list(df.groupby('key1')))

In [33]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -1.731499 -1.261049
 1    a  two  0.470663  0.591722
 4    a  one -0.416168 -0.679561, 'b':   key1 key2     data1     data2
 2    b  one -0.012053 -0.273218
 3    b  two -0.158350 -1.259905}

In [34]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.012053 -0.273218
3    b  two -0.158350 -1.259905

In [35]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [36]:
for dtype,group in grouped:
    print(dtype)
    print(group)

a
0    0.694209
1    0.179757
4   -0.836681
Name: data1, dtype: float64
b
2   -0.800879
3    0.609712
Name: data1, dtype: float64

In [38]:
df['data1'].groupby(df['key1'])

In [39]:
df['data2'].groupby(df['key1'])

In [40]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.970305
     two   0.591722
b    one  -0.273218
     two  -1.259905

In [41]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [42]:
s_grouped

In [43]:
s_grouped.mean()

key1  key2
a     one    -0.970305
      two     0.591722
b     one    -0.273218
      two    -1.259905
Name: data2, dtype: float64

In [91]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [92]:
people

               a         b         c         d         e
Joe     0.974141 -0.472961 -0.853725 -0.770527 -1.894825
Steve   0.863141  0.114848 -1.255859  0.502485  0.904710
Wes    -0.899390  1.189307  0.168375  0.158313  0.538629
Jim    -0.530114  0.383049 -0.518679  1.714729 -0.700430
Travis -0.809967  1.282999 -0.246595  0.108793 -0.133750

In [93]:
people.iloc[2:3,[1,2]]=np.nan

In [94]:
people

               a         b         c         d         e
Joe     0.974141 -0.472961 -0.853725 -0.770527 -1.894825
Steve   0.863141  0.114848 -1.255859  0.502485  0.904710
Wes    -0.899390       NaN       NaN  0.158313  0.538629
Jim    -0.530114  0.383049 -0.518679  1.714729 -0.700430
Travis -0.809967  1.282999 -0.246595  0.108793 -0.133750

In [95]:
people.iloc[2,[1,2]]=np.nan

In [96]:
people

               a         b         c         d         e
Joe     0.974141 -0.472961 -0.853725 -0.770527 -1.894825
Steve   0.863141  0.114848 -1.255859  0.502485  0.904710
Wes    -0.899390       NaN       NaN  0.158313  0.538629
Jim    -0.530114  0.383049 -0.518679  1.714729 -0.700430
Travis -0.809967  1.282999 -0.246595  0.108793 -0.133750

In [97]:
mapping={'a':'red','b':'red','c':'blue',
        'd':'blue','e':'red','f':'orange'}

In [98]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [99]:
by_column=people.groupby(mapping,axis=1)

In [100]:
by_column

In [101]:
by_column.sum()

            blue       red
Joe    -1.624252 -1.393645
Steve  -0.753374  1.882700
Wes     0.158313 -0.360761
Jim     1.196049 -0.847495
Travis -0.137802  0.339283

In [103]:
map_series=pd.Series(mapping)

In [104]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [105]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [106]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.455363 -0.089913 -1.372405  1.102515 -2.056626
5  0.863141  0.114848 -1.255859  0.502485  0.904710
6 -0.809967  1.282999 -0.246595  0.108793 -0.133750

In [107]:
key_list=['one','one','one','two','two']

In [108]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.899390 -0.472961 -0.853725 -0.770527 -1.894825
  two -0.530114  0.383049 -0.518679  1.714729 -0.700430
5 one  0.863141  0.114848 -1.255859  0.502485  0.904710
6 two -0.809967  1.282999 -0.246595  0.108793 -0.133750

In [109]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                  [1,3,5,1,3]],
                                 names=['cty','tenor'])

In [110]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [111]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [112]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.689031 -0.613944  0.016334  0.441041 -1.107458
1     -0.247167 -0.176041 -1.132138 -1.370088 -1.296958
2     -0.620623 -0.457579 -0.285910  0.767368  0.766381
3     -0.473658  1.230574 -0.609948  0.557361 -0.955072

In [113]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [114]:
df

  key1 key2     data1     data2
0    a  one -1.731499 -1.261049
1    a  two  0.470663  0.591722
2    b  one -0.012053 -0.273218
3    b  two -0.158350 -1.259905
4    a  one -0.416168 -0.679561

In [115]:
grouped=df.groupby('key1')

In [116]:
grouped

In [117]:
grouped['data1'].quantile(0.9)

key1
a    0.293297
b   -0.026683
Name: data1, dtype: float64

In [118]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [119]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.202162  1.852771
b     0.146297  0.986687

In [120]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.559001  1.108007 -1.731499 -1.073834 -0.416168  0.027247
b      2.0 -0.085202  0.103448 -0.158350 -0.121776 -0.085202 -0.048627

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.470663   3.0 -0.449629  0.947545 -1.261049 -0.970305 -0.679561
b    -0.012053   2.0 -0.766561  0.697693 -1.259905 -1.013233 -0.766561


           75%       max
key1
a    -0.043919  0.591722
b    -0.519889 -0.273218

In [125]:
tips = pd.read_csv('E:/datawhale1/examples_data_for_data_analysis/tips.csv')

In [126]:
tips[:10]

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [69]:
tips['tip_pct']=tips['tip']/tips['total_bill']

In [128]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [130]:
grouped=tips.groupby(['day','smoker'])

In [131]:
grouped

In [132]:
grouped_pct=grouped['tip_pct']

In [133]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [134]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [135]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [136]:
functions = ['count','mean','max']

In [137]:
result=grouped['tip_pct','total_bill'].agg(functions)

In [138]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [139]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [140]:
ftuples=[('Durchschnitt','mean'),('Abweishung',np.var)]

In [141]:
grouped['tip_pct','total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweishung Durchschnitt  Abweishung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [143]:
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [144]:
grouped.agg({'tip_pct':['min','max','mean','std'],
            'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [145]:
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [149]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [150]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [151]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [152]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [153]:
result=tips.groupby('smoker')['tip_pct'].describe()

In [154]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [155]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [156]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [157]:
frame = pd.DataFrame({'data1':np.random.randn(1000),
                     'data2':np.random.randn(1000)})

In [158]:
quartiles=pd.cut(frame.data1,4)

In [161]:
quartiles[:10]

0     (-1.383, 0.301]
1      (0.301, 1.986]
2    (-3.075, -1.383]
3      (0.301, 1.986]
4     (-1.383, 0.301]
5     (-1.383, 0.301]
6       (1.986, 3.67]
7     (-1.383, 0.301]
8     (-1.383, 0.301]
9      (0.301, 1.986]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.075, -1.383] < (-1.383, 0.301] < (0.301, 1.986] < (1.986, 3.67]]

In [163]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),
           'count':group.count(),'mean':group.mean()}

In [164]:
grouped = frame.data2.groupby(quartiles)

In [165]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.075, -1.383]   70.0  2.517739  0.088303 -1.923173
(-1.383, 0.301]   558.0  3.225519  0.089471 -2.617320
(0.301, 1.986]    356.0  3.180475  0.111171 -2.390212
(1.986, 3.67]      16.0  1.597776  0.220724 -1.087802

In [166]:
grouping = pd.qcut(frame.data1,10,labels=False)

In [168]:
grouped=frame.data2.groupby(grouping)

In [169]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.517739  0.127017 -1.923173
1      100.0  3.225519  0.020604 -1.902994
2      100.0  3.071021  0.127637 -2.555468
3      100.0  2.565902 -0.157148 -2.617320
4      100.0  2.447103  0.295512 -2.059422
5      100.0  2.703401  0.133308 -2.121913
6      100.0  2.720446 -0.035269 -2.170255
7      100.0  3.180475  0.178028 -1.963515
8      100.0  2.464977  0.084528 -2.390212
9      100.0  2.763968  0.217926 -2.011418

In [3]:
s=pd.Series(np.random.randn(6))

In [4]:
s[::2]=np.nan

In [5]:
s

0         NaN
1   -0.225237
2         NaN
3    0.540603
4         NaN
5   -0.651615
dtype: float64

In [6]:
s.fillna(s.mean())

0   -0.112083
1   -0.225237
2   -0.112083
3    0.540603
4   -0.112083
5   -0.651615
dtype: float64

In [12]:
states=['Ohio','New York','Vermont','Florida',
       'Oregon','Nevada','California','Idaho']

In [13]:
group_key=['East']*4+['West']*4

In [14]:
data=pd.Series(np.random.randn(8),index=states)

In [15]:
data

Ohio          0.483340
New York     -0.816826
Vermont      -1.489785
Florida       1.103722
Oregon       -1.247963
Nevada        0.136413
California   -0.655876
Idaho        -0.475348
dtype: float64

In [16]:
data[['Vermont','Nevada','Idaho']]=np.nan

In [17]:
data

Ohio          0.483340
New York     -0.816826
Vermont            NaN
Florida       1.103722
Oregon       -1.247963
Nevada             NaN
California   -0.655876
Idaho              NaN
dtype: float64

In [18]:
data.groupby(group_key).mean()

East    0.256745
West   -0.951919
dtype: float64

In [19]:
fill_mean=lambda g: g.fillna(g.mean())

In [20]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.483340
New York     -0.816826
Vermont       0.256745
Florida       1.103722
Oregon       -1.247963
Nevada       -0.951919
California   -0.655876
Idaho        -0.951919
dtype: float64

In [21]:
fill_values={'East':0.5,'West':-1}

In [22]:
fill_func=lambda g: g.fillna(fill_values[g.name])

In [23]:
data.groupby(group_key).apply(fill_func)

Ohio          0.483340
New York     -0.816826
Vermont       0.500000
Florida       1.103722
Oregon       -1.247963
Nevada       -1.000000
California   -0.655876
Idaho        -1.000000
dtype: float64

In [24]:
suits=['H','S','C','D']
card_val=(list(range(1,11))+[10]*3)*4
base_names=['A']+list(range(2,11))+['J','K','Q']
cards=[]
for suit in ['H','S','C','D']:
    cards.extend(str(num)+suit for num in base_names)
deck = pd.Series(card_val,index=cards)

In [28]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [29]:
def draw(deck,n=5):
    return deck.sample(n)

In [30]:
draw(deck)

3C      3
5H      5
3S      3
AC      1
10D    10
dtype: int64

In [31]:
get_suit  = lambda card: card[-1]

In [32]:
deck.groupby(get_suit).apply(draw,n=2)

C  10C    10
   JC     10
D  10D    10
   QD     10
H  6H      6
   5H      5
S  JS     10
   AS      1
dtype: int64

In [33]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

QC     10
5C      5
6D      6
AD      1
10H    10
7H      7
4S      4
8S      8
dtype: int64

In [34]:
df=pd.DataFrame({'category':['a','a','a','a',
                            'b','b','b','b'],
                'data':np.random.randn(8),
                'weight':np.random.rand(8)})

In [35]:
df

  category      data    weight
0        a  1.182217  0.667306
1        a -0.194705  0.292585
2        a  0.527385  0.008695
3        a -2.662652  0.316273
4        b  0.299526  0.615949
5        b -0.910207  0.633526
6        b  1.021359  0.508597
7        b  0.760451  0.561815

In [36]:
grouped=df.groupby('category')

In [37]:
get_wavg=lambda g: np.average(g['data'],weights=g['weight'])

In [38]:
grouped.apply(get_wavg)

category
a   -0.082194
b    0.239040
dtype: float64

In [48]:
close_px=pd.read_csv('E:\datawhale1\examples_data_for_data_analysis\stock_px_2.csv',parse_dates=True,index_col=0)

In [49]:
close_px[:10]

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01
2003-01-07  7.43  21.93  28.95  922.93
2003-01-08  7.28  21.31  28.83  909.93
2003-01-09  7.34  21.93  29.44  927.57
2003-01-10  7.36  21.97  29.03  927.57
2003-01-13  7.32  22.16  28.91  926.26
2003-01-14  7.30  22.39  29.17  931.66
2003-01-15  7.22  22.11  28.77  918.22

In [50]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [51]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [52]:
spx_corr=lambda x:x.corrwith(x['SPX'])

In [53]:
rets = close_px.pct_change().dropna()

In [55]:
get_year = lambda x: x.year

In [56]:
by_year = rets.groupby(get_year)

In [57]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [58]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [61]:
import statsmodels.api as sm
def regress(data,yvar,xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept']=1
    result = sm.OLS(Y,X).fit()
    return result.params

In [62]:
by_year.apply(regress,'AAPL',['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [66]:
tips = pd.read_csv('E://datawhale1/examples_data_for_data_analysis/tips.csv')

In [67]:
tips.pivot_table(index=['day','smoker'])

                 size       tip  total_bill
day  smoker
Fri  No      2.250000  2.812500   18.420000
     Yes     2.066667  2.714000   16.813333
Sat  No      2.555556  3.102889   19.661778
     Yes     2.476190  2.875476   21.276667
Sun  No      2.929825  3.167895   20.506667
     Yes     2.578947  3.516842   24.120000
Thur No      2.488889  2.673778   17.113111
     Yes     2.352941  3.030000   19.190588

In [70]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],
                columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [71]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],
                columns='smoker',margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [73]:
tips.pivot_table('tip_pct',index=['time','smoker'],columns='day',aggfunc=len,margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [74]:
tips.pivot_table('tip_pct',index=['time','size','smoker'],
                columns='day',aggfunc='mean',fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [82]:
data=pd.DataFrame({'Sample':['1','2','3','4','5','6','7','8','9','10'],
                   'nation':['U','J','U','J','J','J','U','U','J','U'],
                 'Handedness':['R','L','R','R','L','R','R','L','R','R']})

In [80]:
data

  Sample nation Handedness
0      1      U          R
1      2      J          L
2      3      U          R
3      4      J          R
4      5      J          L
5      6      j          R
6      7      U          R
7      8      U          L
8      9      J          R
9     10      U          R

In [83]:
pd.crosstab(data.nation,data.Handedness,margins=True)

Handedness  L  R  All
nation
J           2  3    5
U           1  4    5
All         3  7   10

In [85]:
pd.crosstab([tips.time,tips.day],tips.smoker,margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244